-- Заполнение данных актеров
INSERT INTO actors (actor_id, actor_name, surname, patronymic, date_of_birth, age,
            gender, photo, biography, roles, plays)
VALUES
    (gen_random_uuid(), 'Иван', 'Иванов', 'Иванович', '1980-01-01', 43, 'Мужчина',
     NULL, NULL, NULL, '{"главные": ["Гамлет", "Ромео"]}'),

	(gen_random_uuid(), 'Петр', 'Петров', 'Петрович', '1985-02-02', 38, 'Мужчина',
     NULL, NULL, NULL, '{"второстепенные": ["Офелия"]}'),

	(gen_random_uuid(), 'Мария', 'Сидорова', 'Александровна', '1990-03-03', 33, 'Женщина',
     NULL, NULL, NULL, '{"поддержка": ["Лиза"]}'),

	(gen_random_uuid(), 'Анна', 'Кузнецова', 'Павловна', '1995-04-04', 28, 'Женщина',
     NULL, NULL, NULL, '{"главные": ["Дездемона"]}'),

	(gen_random_uuid(), 'Елена', 'Смирнова', 'Игоревна', '1975-05-05', 48, 'Женщина',
     NULL, NULL, NULL, '{"второстепенные": ["Катерина"]}');

-- Заполнение таблицы режиссеров
INSERT INTO filmmakers (filmmaker_id, filmmaker_name, surname, patronymic, date_of_birth, age, gender, photo, biography, plays)
VALUES
    (gen_random_uuid(), 'Александр', 'Федоров', 'Сергеевич', '1970-06-06', 53,
     'Мужчина', NULL, NULL, '{"постановки": ["Гамлет", "Король Лир"]}'),

    (gen_random_uuid(), 'Николай', 'Ильин', 'Викторович', '1982-07-07', 41,
     'Мужчина', NULL, NULL, '{"постановки": ["Ревизор", "На дне"]}'),

    (gen_random_uuid(), 'Ольга', 'Павлова', 'Васильевна', '1988-08-08', 35,
     'Женщина', NULL, NULL, '{"постановки": ["Отелло", "Вишневый сад"]}'),

    (gen_random_uuid(), 'Дмитрий', 'Козлов', 'Иванович', '1979-09-09', 44,
     'Мужчина', NULL, NULL, '{"постановки": ["Женитьба Фигаро"]}'),

    (gen_random_uuid(), 'Екатерина', 'Морозова', 'Андреевна', '1983-10-10', 40,
     'Женщина', NULL, NULL, '{"постановки": ["Борис Годунов"]}');

-- Заполнение данных постановщиков
INSERT INTO stagehands (stagehand_id, stagehand_name, surname, patronymic, date_of_birth, age, gender, photo, biography, plays)
VALUES
    (gen_random_uuid(), 'Сергей', 'Волков', 'Михайлович', '1981-11-11', 42,
     'Мужчина', NULL, NULL, '{"сцены": ["Большая сцена", "Малая сцена"]}'),

    (gen_random_uuid(), 'Ирина', 'Тихонова', 'Семеновна', '1986-12-12', 37,
     'Женщина', NULL, NULL, '{"сцены": ["Экспериментальная сцена"]}'),

    (gen_random_uuid(), 'Максим', 'Соловьев', 'Федорович', '1992-01-13', 31,
     'Мужчина', NULL, NULL, '{"сцены": ["Летняя сцена"]}'),

    (gen_random_uuid(), 'Татьяна', 'Гордеева', 'Олеговна', '1978-02-14', 45,
     'Женщина', NULL, NULL, '{"сцены": ["Зал на крыше"]}'),

    (gen_random_uuid(), 'Владислав', 'Никифоров', 'Геннадьевич', '1984-03-15', 39,
     'Мужчина', NULL, NULL, '{"сцены": ["Эстрадный зал"]}');

-- Заполнение данных художников
INSERT INTO artists (artist_id, artist_name, surname, patronymic, date_of_birth, age, gender, photo, biography, plays)
VALUES
    (gen_random_uuid(), 'Виктория', 'Лебедева', 'Александровна', '1991-04-16', 32,
     'Женщина', NULL, NULL, '{"декорации": ["Гамлет"]}'),

    (gen_random_uuid(), 'Артур', 'Семенов', 'Владимирович', '1987-05-17', 36,
     'Мужчина', NULL, NULL, '{"декорации": ["Ревизор"]}'),

    (gen_random_uuid(), 'Светлана', 'Борисова', 'Юрьевна', '1977-06-18', 46,
     'Женщина', NULL, NULL, '{"декорации": ["На дне"]}'),

    (gen_random_uuid(), 'Константин', 'Ершов', 'Леонидович', '1983-07-19', 40,
     'Мужчина', NULL, NULL, '{"декорации": ["Отелло"]}'),

    (gen_random_uuid(), 'Евгения', 'Киселева', 'Романовна', '1994-08-20', 29,
     'Женщина', NULL, NULL, '{"декорации": ["Вишневый сад"]}');

-- Заполнение данных композиторов
INSERT INTO composers (composer_id, composer_name, surname, patronymic, date_of_birth, age, gender, photo, biography, plays)
VALUES
    (gen_random_uuid(), 'Григорий', 'Зайцев', 'Ильич', '1976-09-21', 47,
     'Мужчина', NULL, NULL, '{"музыка": ["Гамлет"]}'),

    (gen_random_uuid(), 'Алла', 'Ефимова', 'Петровна', '1989-10-22', 34,
     'Женщина', NULL, NULL, '{"музыка": ["Ревизор"]}'),

    (gen_random_uuid(), 'Валерий', 'Крылов', 'Николаевич', '1990-11-23', 33,
     'Мужчина', NULL, NULL, '{"музыка": ["На дне"]}'),

    (gen_random_uuid(), 'Зоя', 'Савельева', 'Витальевна', '1982-12-24', 41,
     'Женщина', NULL, NULL, '{"музыка": ["Отелло"]}'),

    (gen_random_uuid(), 'Павел', 'Гаврилов', 'Макарович', '1988-01-25', 35,
     'Мужчина', NULL, NULL, '{"музыка": ["Вишневый сад"]}');

INSERT INTO pieces (piece_id, title, author, year_written, genre, plays)
VALUES
    (gen_random_uuid(), 'Гамлет', 'Уильям Шекспир', 1600, 'Трагедия', NULL),

    (gen_random_uuid(), 'Ревизор', 'Николай Гоголь', 1836, 'Комедия', NULL),

    (gen_random_uuid(), 'Вишневый сад', 'Антон Чехов', 1904, 'Драма', NULL),

    (gen_random_uuid(), 'На дне', 'Максим Горький', 1902, 'Драма', NULL),

    (gen_random_uuid(), 'Отелло', 'Уильям Шекспир', 1604, 'Трагедия', NULL);


